Revit 2027 API
UIApplication.LoadedApplications Property
 Returns an array of successfully loaded external applications.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ExternalApplicationArray LoadedApplications { get; }
Public Overridable ReadOnly Property LoadedApplications As ExternalApplicationArray
	Get
public:
virtual property ExternalApplicationArray^ LoadedApplications {
	ExternalApplicationArray^ get ();
}
abstract LoadedApplications : ExternalApplicationArray with get
override LoadedApplications : ExternalApplicationArray with get
Property Value
ExternalApplicationArray
Remarks
 This property can be used by your application to find all successfully loaded external applications when Revit starts.
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace